load(url("http://www.keihirose.com/spam.Rdata"))
dim(X.train)


#### 学習用データの確認
dim(X.train)#学習用データn=3601,m=53
t(X.train[1:20,1:5])#最初の10個メール、５個の変数だけ表示
spam.train[1:3601] #spam = 1,ham = 0

###テスト用データの確認
dim(X.test)#テスト用データ
t(X.test[1:10,1:53]) #最初の１０個のメール、５個の変数だけ表示)
spam.test[1:10]#これは隠しておく

#学習データのスパームメールの割合でp(y=1)の計算
n = 3601
p_y_1 <- function(){
	y<-spam.train
	total_spam <- 0
	for(i in 1:n){
		total_spam <- total_spam + y[i]
	}
	prob <- total_spam / n
	return(prob)
}
p_y_1()

p_y_0 <- function(){
	return(1-p_y_1())
}
p_y_0()

P_Xj_y_1 <- function(j){
	total_spam = 0
	word_j_count = 0
	for(i in 1:n){
		if(spam.train[i] == 1)
		{
			total_spam <- total_spam + 1
			if(X.train[i,j] == 1){
				word_j_count <- word_j_count + 1
			}			
		}
	}
	
	return(word_j_count / total_spam)
}


P_Xj_y_0 <- function(j){
	total_not_spam = 0
	word_j_count = 0
	for(i in 1:n){
		if(spam.train[i] == 0)
		{
			total_not_spam <- total_not_spam + 1
			if(X.train[i,j] == 1){
				word_j_count <- word_j_count + 1
			}			
		}
	}
	
	return(word_j_count / total_not_spam)
}


P_y_1_Xj12... <- function(mail_n){
	P_X12.._y_0 <- 1
	P_X12.._y_1 <- 1
	for(i in 1:p){
		if(X.test[mail_n,i] == 1){
		 		P_X12.._y_0 <- P_X12.._y_0 * P_Xj_y_0(j)
		 		P_X12.._y_1 <- P_X12.._y_1 * P_Xj_y_1(j)
		}else{
				P_X12.._y_0 <- P_X12.._y_0 * (1 - P_Xj_y_0(j))
			    P_X12.._y_1 <- P_X12.._y_1 * (1 - P_Xj_y_1(j))
		}
	}

	nom <- P_X12.._y_1* p_y_1()
	den <- (P_X12.._y_0* p_y_0() + P_X12.._y_1 *p_y_1())	
	return(nom/den)
}

P_y_1_Xj12...(1)

n = 1000
spam.determined <- rep(0,1000)
error <- 0
for(i in 1:n){
	ret<-P_y_1_Xj12...(i)
	if(ret >= 0.5){
		spam.determined[i] <- 1
	}
	print(spam.determined[i])
	if(spam.determined[i] != spam.test[i]){
		error <- error + 1
	}
	#print(error)
}
spam.determined
   [1] 1 0 0 1 0 0 1 1 0 0 1 0 1 0 1 0 1 1 1 0 0 0 0 0 0 1 1 1 0 1 0 0 0 0 0 1 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 1 0 1 0 1 0 0 1 0 0 0 1 0 1 0 0 0
  [77] 0 1 1 1 0 0 0 0 1 0 1 1 1 1 0 0 0 0 0 1 0 1 1 0 1 0 0 0 0 0 0 1 1 1 1 0 1 0 1 1 0 1 0 0 0 0 1 0 1 0 0 0 0 1 0 0 1 1 0 0 0 0 0 0 1 1 1 0 0 1 0 1 0 0 0 0
 [153] 1 1 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 1 1 0 0 1 1 0 0 0 0 1 0 0 0 1 0 0 0 1 1 0 0 0 0 0 1 1 1 1 0 1 0 1 0 1 0 1 0 1 1 0 0 0 1 1 0 0 0 1 0 0 0 0 0 0 0 1 0
 [229] 1 0 0 0 0 1 0 0 0 1 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 1 1 1 1 1 0 1 0 0 0 0 0 0 1 0 1 0 1 0 1 1 1 1 0 0 0 0 0 1 0 0 0 1 0 1 1 0 0 0 0 0 0 0 0
 [305] 1 0 0 0 0 0 1 0 0 0 0 0 1 0 1 1 0 1 0 0 0 0 0 1 0 0 1 1 0 0 0 1 0 0 0 0 0 1 1 0 0 1 0 0 0 1 0 1 0 1 0 1 0 0 0 1 0 0 1 0 1 1 1 0 0 0 0 0 0 0 0 1 0 1 1 0
 [381] 0 0 1 1 0 0 1 1 0 1 0 1 0 0 0 0 1 1 0 1 0 1 0 0 0 0 0 0 0 1 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 0 1 1 1 0 1 1 0 0 1 0 0 1 1 0 0 1 0 0 0 1
 [457] 1 0 1 0 1 1 1 0 0 0 1 0 0 1 0 1 1 0 0 0 0 1 1 1 0 1 0 1 1 0 1 1 0 1 0 1 0 1 0 0 1 1 0 0 0 0 0 1 1 0 0 0 0 0 1 0 0 1 1 1 0 1 1 0 0 1 0 0 1 0 0 1 0 0 0 1
 [533] 1 0 1 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 1 0 1 0 1 0 0 0 0 1 0 1 0 0 1 0 0 0 0 0 0 1 0 0 0 1 0 1 0 1 1 0 1 0 1 0 1 0 1 1 0 0 1 0 0 1 0 1 0 0 0
 [609] 0 1 0 1 0 1 1 1 1 1 0 0 0 1 1 1 1 0 1 0 1 0 0 1 1 0 0 1 0 0 0 0 0 0 0 1 0 0 0 0 1 1 1 1 0 1 0 1 0 0 1 1 0 0 1 0 0 0 1 0 0 0 0 1 0 0 1 0 0 1 1 1 0 1 0 1
 [685] 0 0 0 0 1 1 0 1 0 0 1 0 0 1 0 0 0 1 0 1 0 0 0 0 0 0 1 0 0 1 0 0 0 0 1 0 1 0 0 1 0 1 0 0 0 0 1 1 0 0 1 0 1 1 0 0 0 0 1 1 0 1 0 1 0 0 0 0 0 1 0 0 1 0 1 0
 [761] 0 0 0 0 0 1 0 0 0 0 0 0 1 1 1 0 1 1 0 0 0 0 0 0 0 0 1 0 1 0 0 1 0 0 0 0 0 0 1 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 1 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0
 [837] 0 0 0 0 0 0 0 0 1 1 1 1 0 0 0 1 0 0 0 0 0 0 0 0 0 1 0 0 0 1 1 0 0 1 1 0 1 0 1 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0 1 0 0 0 0 0 0 1 1 1 0
 [913] 0 0 0 0 1 0 0 0 1 0 0 0 1 0 1 0 0 1 1 0 0 0 0 1 1 0 1 0 1 0 1 0 0 0 0 0 1 0 0 0 1 0 1 0 1 1 1 0 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 1 0 0 0 1 1 1
 [989] 0 0 0 0 0 1 0 0 1 0 0 1
error
ratio <- error / n
ratio
