load(url('http://www.keihirose.com/spam200.Rdata'))
X = scale(X.train)

#Variance Covariance matrix
Sigma = var(X)

#Eigen Value Lambda, Eigen Vector Matrix V
a = eigen(Sigma)

lambda =a$values
lambda
V = a$vectors
V


#Calculating principle co-efficient
Y = X %*% V

#First principal component and second principal component

Y[,1]
Y[,2]


#第１主成分の解釈
sort(V[,1])
 [1] -0.279954224 -0.277690228 -0.257089745 -0.251093685 -0.242709636 -0.223729318 -0.206194061 -0.201553667 -0.200321460 -0.192767705 -0.189526728 -0.186692319
[13] -0.183892822 -0.180547221 -0.179019081 -0.175769938 -0.174018150 -0.173196448 -0.165991160 -0.163392980 -0.155475515 -0.152536500 -0.149733290 -0.105913392
[25] -0.095772292 -0.092769804 -0.083302644 -0.073967356 -0.056071535 -0.038787210 -0.031829571 -0.026833989 -0.021770051 -0.021377729 -0.021351410 -0.016763632
[37] -0.014850955 -0.011891016 -0.010992652  0.003145293  0.004343028  0.004926574  0.005673054  0.009748490  0.012810776  0.014033312  0.015942876  0.016029660
[49]  0.016431665  0.017635856  0.019059194  0.020436165  0.095423471
max(V[,1])
#0.09542347
which.max(V[,1])
#27
#第１主成分の解釈
sort(V[,1])
max(V[,1])
#0.09542347
which.max(V[,1])
#27
固有ベクトルv1の27番目の成分 0.09542347. これから分かるのは、データの27番目の変数(george)は第１主成分の値に一番影響させている。

固有ベクトルv1の52番目の成分 -0.279954224.負の値で考えるとこれが一番大きい。だからデータの52番目の変数(char_freq_$)の値の影響もある。
3番目の変数 “all”  (v_k3 = -0.277690228) ,
21番目の変数 “your” (v_k21= -0.257089745),
12番目の変数 “will” (v_k12= -0.251093685),
4番目の変数”3d”(v_k4=-0.242709636),
も第１主成分の値を大きく変化させる。

V[2,]
sort(V[2,])
which.max(V[2,])
#第２主成分の解釈
17番目の変数business (v_2,17 = 0.3679116689) が第２主成分の値に一番影響させる。
37番目の変数1999 (v_2,37 = 0.2992848825), 
19番目の変数you (v_2,19=0.2902358244) ,
21番目の変数your(v_2,21=0.2673461623)
14番目の変数report(v_2,14=0.2627477489) の影響も第２主成分に対して大きいと言える。
